      *DIVISION HEADER
       IDENTIFICATION DIVISION.
      *PROGRAM NAME (NOTE – PROGRAM NAME IS A USER SUPPLIED WORD)
       PROGRAM-ID. CST8283-PROJECT-1 AS "CST8283-PROJECT-1".
      *OPTIONAL ENTRIES  (PARAGRAPH HEADERS)
       AUTHOR. CHU-YU-YUN.
       DATE-WRITTEN. JUNE 11TH 2020.
       DATE-COMPILED. JUNE 13TH 2020.
       SECURITY.  PROF MEL SANSCHAGRIN & PROF JASON MOMBOURQUETTE.
      *************************************************************
      * REFERENCE:                                                *
      * CST8283 ALL SLIDES                                        *
      * HTTPS://WWW.TUTORIALSPOINT.COM/COBOL/COBOL_DATA_TYPES.HTM *
      *                                                           *                                                        
      *************************************************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENT-FILE-OUT
              ASSIGN TO "./INVFILE.TXT"
              ORGANIZATION IS SEQUENTIAL.
           
      *DATA DIVISION: DEFINE THE VARIABLES USED IN A PROGRAM. 
      *>> TERMS: DATA NAME, LEVEL NUMBER, PICTURE CLAUSE, VALUE CLAUSE
      *>> DATA NAMES:
      *- MUST BE DEFINED IN THE DATA DIVISION B4 USING THEM IN THE 
      *PROCEDURE DIVISION;
      *- MUST HAVE A USER-DEFINED NAME;
      *- RESERVED WORDS CANNOT BE USED;
      *- DATA NAMES GIVE REFERENCE TO THE MEMORY LOCATIONS WHERE ACTUAL 
      *  DATA IS STORED;
      *- CAN BE ELEMENTARY OR GROUP TYPE.
       DATA DIVISION.
       FILE SECTION.
       
       FD INVENT-FILE-OUT.
      *RECORD FOR FILE OUTPUT
       01 INVENT-RECORD-OUT PIC 9(15).
       
       WORKING-STORAGE SECTION.
      *STORES USER INPUT FOR ENTERING ANOTHER INVENTORY ITEM
       01 EOF-FLAG PIC X(1) VALUE 'Y'.
      *01: GROUP OF INVENTORY ITEM DATA. 
       01 INVENT-INPUT.
      *05: ELEMENTARY ITEMS FOR INVENTORY ITEM.
           05 PART-NUMBER PIC 9(7).
           05 QUANTITY PIC 9(4).
           05 PRICE PIC 9(4).

       PROCEDURE DIVISION.
      
      *MAIN PROCEDURE   
       100-PRODUCE-EXTERNAL-FILE.
           PERFORM 201-INITIATE-EXTERNAL-FILE.
           PERFORM 202-PRODUCE-EXTERNAL-RECORD 
      *PERFORM UNTIL: THE USER ENTERS 'N' FOR ANOTHER ITEM
             UNTIL EOF-FLAG = 'N' OR EOF-FLAG = 'N'.                   
           PERFORM 203-TERMINATE-EXTERNAL-FILE.  
      *STOP RUN: END THE EXECUTION IN THIS DIVISION.    
           STOP RUN.
           
      *INITIATE FILE OPENINING
       201-INITIATE-EXTERNAL-FILE.
           PERFORM 301-OPEN-EXTERNAL-FILE.
           
      *MAIN PROGRAM LOOP    
       202-PRODUCE-EXTERNAL-RECORD.
           PERFORM 302-PROMPT-USER-FOR-RECORD.                          
           PERFORM 303-WRITE-RECORD-TO-FILE.
           PERFORM 304-PROMPT-USER-FOR-ANOTHER-RECORD.
                                       
      *CLOSE THE OUTPUT FILE.
       203-TERMINATE-EXTERNAL-FILE.
           305-CLOSE-EXTERNAL-RECORD-AND-FILE.                         
      
      *OPEN THE OUTPUT FILE
       301-OPEN-EXTERNAL-FILE.
           OPEN OUTPUT INVENT-FILE-OUT.

      *PROMT QUERIES    
       302-PROMPT-USER-FOR-RECORD.
      *DISPLAY THE OUTPUT  
           DISPLAY "ENTER THE PART NUMBER: "       LINE 4 COLUMN 5.
      *GET DATA FROM THE USER 
           ACCEPT PART-NUMBER                      LINE 5 COLUMN 10.
           DISPLAY "ENTER THE QUANTITY: "          LINE 6 COLUMN 5.
           ACCEPT QUANTITY                         LINE 7 COLUMN 10.   
           DISPLAY "ENTER THE UNIT PRICE: "        LINE 8 COLUMN 5.
           ACCEPT PRICE                            LINE 9 COLUMN 10.
      
      *WRITE DATA INTO THE OUTPUT FILE.
       303-WRITE-RECORD-TO-FILE.
      *    COPY DATA FROM USER INPUT DATA TO FILE RECORD.
           MOVE INVENT-INPUT TO INVENT-RECORD-OUT.
      *    WRITE THE ROCORD TO THE FILE    
           WRITE INVENT-RECORD-OUT.
      *    CLEAR USER INPUT VALUES    
           INITIALIZE INVENT-INPUT.
           
      *PROMT ANOTHER QURIES.
       304-PROMPT-USER-FOR-ANOTHER-RECORD.
           DISPLAY "ENTER ANOTHER PART? [Y/N] "    LINE 16 COLUMN 10.
           ACCEPT EOF-FLAG                         LINE 17 COLUMN 10.
           DISPLAY " " WITH BLANK SCREEN.
      
      *CLOSE THE OUTPUT FILE 
       305-CLOSE-EXTERNAL-RECORD-AND-FILE.
           CLOSE INVENT-FILE-OUT.

      *EXIT THIS COBOL PROGRAM
       END PROGRAM CST8283-PROJECT-1.